Revit 2027 API
Mesh.Triangle Property
Retrieves a specific triangle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MeshTriangle this[
	int idx
] { get; }
Public ReadOnly Property Triangle (
	idx As Integer
) As MeshTriangle
	Get
public:
property MeshTriangle^ Triangle[int idx] {
	MeshTriangle^ get (int idx);
}
member Triangle : MeshTriangle with get
Parameters
idx Int32
Index of the triangle, must be in [0, NumTriangles).
Property Value
MeshTriangle
See Also
Reference
Mesh Class
Autodesk.Revit.DB Namespace